## C(reate) R(ead) U(pdate) D(elete)

In [ ]:
CREATE TABLE state_populations (^state VARCHAR(2) PRIMARY KEY,
population NUMERIC
);

In [ ]:
CREATE TABLE countries (
key INT PRIMARY KEY,
name text UNIQUE,
founding_year INT,
capital text
);

In [ ]:
For instance, say you wanted to create a table based on the products table that only had products from the year 2014. Let's call this table products_2014. You could then write the following query:

CREATE TABLE products_2014 AS (
SELECT *
FROM products
WHERE year=2014
);

In [ ]:
To add new columns to an existing table, we use the ADD COLUMN statement as in the following query:

ALTER TABLE {table_name}
ADD COLUMN {column_name} {data_type};


ALTER TABLE products
ADD COLUMN weight INT;

ALTER TABLE {table_name}
DROP COLUMN {column_name};

ALTER TABLE products
DROP COLUMN weight;

In [ ]:
Adding New Data

As an example, let's say you wanted to insert a new scooter into the products table. 
This could be done with the following query:

INSERT INTO products (product_id, model, year, product_type, base_msrp, production_start_date, production_end_date)
VALUES (13, "Nimbus 5000", 2019, 'scooter', 500.00, '2019-03-03', '2020-03-03');

INSERT INTO products (product_id, model, year, product_type, base_msrp, production_start_date, production_end_date) 
SELECT *
FROM products
WHERE year=2014;

In [ ]:
Updating Existing Rows

let's say that for the rest of the year, the company has decided to sell all scooter models before 2018 for $299.99. 
We could change the data in the products table using the following query:

UPDATE products
SET base_msrp = 299.99,
WHERE product_type = 'scooter'
AND year<2018;

In [ ]:
UPDATE products
SET base_msrp = base_msrp*1.10
WHERE model='Model Chi'
and year=2019;

In [ ]:
Deleting Values from a Row

Let's say, for instance, that we have the wrong email on file for the customer with the customer ID equal to 3. To fix that, we can use the following query:

UPDATE customers
SET email = NULL
WHERE customer_id=3;

In [ ]:
Deleting Rows from a Table
Deleting a row from a table can be done using the DELETE statement, which looks like this:

DELETE FROM {table_name}
WHERE {conditional};
DELETE FROM customers
WHERE email='bjordan2@geocities.com';

In [ ]:
If we wanted to delete all the data in the customers table without deleting the table, we could write the following query:

DELETE FROM customers;

Copy
Alternatively, if you want to delete all the data in a query without deleting the table, you could use the TRUNCATE keyword as follows:

TRUNCATE TABLE customers;

In [ ]:
Deleting Tables

DROP TABLE customers;

In [ ]:
SELECT first_name
FROM customers
WHERE state='AZ'
ORDER BY first_name

In [ ]:
SELECT *
FROM products;

In [ ]:
SELECT product_id, model
FROM products;

In [ ]:
SELECT model
FROM products
WHERE year=2014
AND msrp<=1000;

In [ ]:
SELECT model
FROM products
WHERE year=2014
OR product_type='automobile';

In [ ]:
SELECT *
FROM products
WHERE year>2014
AND year<2016
OR product_type='scooter';

In [ ]:
SELECT *
FROM products
WHERE (year>2014 AND year<2016)
OR product_type='scooter';

In [ ]:
SELECT model
FROM products
WHERE year = 2014
OR year = 2016
OR year = 2019;

In [ ]:
SELECT model
FROM products
WHERE year IN (2014, 2016, 2019);

In [ ]:
SELECT model
FROM products
WHERE year NOT IN (2014, 2016, 2019);

In [ ]:
SELECT model
FROM products
ORDER BY production_start_date DESC;

In [ ]:
However, because product_id is the first column in the table, you could instead write:

SELECT model
FROM products
ORDER BY 1;

In [ ]:
SELECT *
FROM products
ORDER BY year DESC, base_msrp ASC;

In [ ]:
SELECT model
FROM products
ORDER BY production_start_date
LIMIT 5;

In [ ]:
SELECT *
FROM products
WHERE production_end_date IS NULL

In [ ]:
SELECT *
FROM products
WHERE production_end_date IS NOT NULL

In [ ]:
SELECT username
FROM salespeople
WHERE gender= 'Female'
ORDER BY hire_date
LIMIT 10

In [ ]:
##inner JOINS & ALIAS: 
inner joins will only return rows from the two tables, and only if the join predicate is met for both rows. 
Otherwise, no rows from either table are returned.

SELECT s.*
FROM salespeople s
INNER JOIN dealerships d
    ON d.dealership_id = s.dealership_id
WHERE d.state = 'CA'
ORDER BY 1;

SELECT s.*
FROM salespeople AS s
INNER JOIN dealerships AS d
    ON d.dealership_id = s.dealership_id
WHERE d.state = 'CA'
ORDER BY 1;

In [ ]:
### OUTER JOIN:
Left outer joins are where the left table (that is, the table mentioned first in a join clause) will have every row returned. 
If a row from the other table is not found, a row of NULL is returned.

SELECT *
FROM customers c
LEFT OUTER JOIN emails e ON e.customer_id=c.customer_id
ORDER BY c.customer_id
LIMIT 1000;

In [ ]:
SELECT *
FROM customers c
LEFT OUTER JOIN emails e ON c.customer_id = e.customer_id 
WHERE e.customer_id IS NULL
ORDER BY c.customer_id
LIMIT 1000

In [ ]:
#A right outer join is very similar to a left join, except the table on the "right" (the second listed table) 
#will now have every row show up, and the "left" table will have NULLs if the join condition is not met. 

SELECT *
FROM emails e
RIGHT OUTER JOIN customers c ON e.customer_id=c.customer_id
ORDER BY c.customer_id
LIMIT 1000;

In [ ]:
#The full outer join will return all rows from the left and right tables, regardless of whether the join predicate 
#is matched. For rows where the join predicate is met, the two rows are combined in a group. 
#For rows where they are not met, the row has NULL filled in. 

SELECT * 
FROM email e
FULL OUTER JOIN customers c
ON e.customer_id=c.customer_id;

In [ ]:
SELECT c.customer_id,
c.first_name,
c.last_name,
c.phone
FROM sales s
INNER JOIN customers c ON c.customer_id=s.customer_id
INNER JOIN products p ON p.product_id=s.product_id
WHERE p.product_type='automobile'
AND c.phone IS NOT NULL

In [ ]:
SELECT *
FROM salespeople
INNER JOIN (
    SELECT * FROM dealerships
    WHERE dealerships.state = 'CA'
    ) d
  ON d.dealership_id = salespeople.dealership_id
ORDER BY 1

In [ ]:
# UNION

(
SELECT street_address, city, state, postal_code
FROM customers
WHERE street_address IS NOT NULL
)
UNION
(
SELECT street_address, city, state, postal_code
FROM dealerships
WHERE street_address IS NOT NULL
)
ORDER BY 1;

In [ ]:
Write a query that will make a list of ZoomZoom customers and company employees who live in Los Angeles, CA. 
The guest list should contain the first name, the last name, and whether the guest is a customer or an employee:

(
SELECT first_name, last_name, 'Customer' as guest_type
FROM customers
WHERE city='Los Angeles'
AND state='CA'
)
UNION
(
SELECT first_name, last_name, 'Employee' as guest_type
FROM salespeople s
INNER JOIN dealerships d ON d.dealership_id=s.dealership_id
WHERE d.city='Los Angeles'
AND d.state='CA'
)

### Aggregate Functions

In [ ]:
SELECT COUNT(customer_id) FROM customers;

In [ ]:
SELECT COUNT(DISTINCT state) FROM customers;

In [ ]:
SELECT COUNT(*) FROM customers WHERE state='CA';

In [ ]:
SELECT SUM(base_msrp)::FLOAT/COUNT(*) AS avg_base_msrp FROM products

In [ ]:
SELECT MIN(base_msrp), MAX(base_msrp), AVG(base_msrp), STDDEV(base_msrp)
FROM products;

In [ ]:
SELECT DISTINCT state FROM customers;

In [ ]:
SELECT state, COUNT(*) FROM customers GROUP BY state

In [ ]:
SELECT state, COUNT(*) FROM customers
GROUP BY 1

In [ ]:
#If you want to return the output in alphabetical order, simply use the following query:

SELECT state, COUNT(*) FROM customers GROUP BY state ORDER BY state

#Alternatively, we can write:

SELECT state, COUNT(*) FROM customers GROUP BY 1ORDER BY 1

In [ ]:
#Customer count by the state query output in alphabetical order

SELECT state, COUNT(*) FROM customers GROUP BY state ORDER BY COUNT(*)

In [ ]:
#Customer count by the state query output in increasing order

SELECT state, COUNT(*) FROM customers WHERE gender='M' GROUP BY state ORDER BY state

In [ ]:
SELECT state, gender, COUNT(*) FROM customers GROUP BY state, genderORDER BY state, gender

In [ ]:
SELECT product_type, MIN(base_msrp), MAX(base_msrp), AVG(base_msrp), STDDEV(base_msrp)
FROM products
GROUP BY 1
ORDER BY 1;

### Grouping Sets
Now, let's say you wanted to count the total number of customers you have in each state, while simultaneously, in the same aggregate functions, counting the total number of male and female customers you have in each state.

In [ ]:
(
SELECT state, NULL as gender, COUNT(*)
FROM customers
GROUP BY 1, 2
ORDER BY 1, 2
)
UNION ALL
(
(
SELECT state, gender, COUNT(*)
FROM customers
GROUP BY 1, 2
ORDER BY 1, 2
)
)
ORDER BY 1, 2

#Alternative

SELECT state, gender, COUNT(*)
FROM customers
GROUP BY GROUPING SETS (
(state),
(gender),
(state, gender)
)
ORDER BY 1, 2

In [ ]:
# Customer count by the state with at least 1,000 customers
SELECT state, COUNT(*)
FROM customers
GROUP BY state
HAVING COUNT(*)>=1,000
ORDER BY state

### Transforming Date Types

In [ ]:
# SELECT current_date,
    EXTRACT(year FROM current_date) AS year,
    EXTRACT(month FROM current_date) AS month,
    EXTRACT(day FROM current_date) AS day;

In [ ]:
# Similarly, we can abbreviate these components as y, mon, and d, and Postgres will understand what we want:

# SELECT current_date,
    EXTRACT(y FROM current_date) AS year,
    EXTRACT(mon FROM current_date) AS month,
    EXTRACT(d FROM current_date) AS day;

In [ ]:
# SELECT current_date,
    EXTRACT(dow FROM current_date) AS day_of_week,
    EXTRACT(week FROM current_date) AS week_of_year,
    EXTRACT(quarter FROM current_date) AS quarter;

In [ ]:
# Intervals
SELECT INTERVAL '5 days';

#Intervals are useful for subtracting timestamps, for example:

SELECT TIMESTAMP '2016-03-01 00:00:00' - TIMESTAMP '2016-02-01 00:00:00' AS days_in_feb;

#Or, alternatively, intervals can be used to add the number of days to a timestamp:

SELECT TIMESTAMP '2016-03-01 00:00:00' + INTERVAL '7 days' AS new_date;

SELECT DATE '2016-03-01' + 7 AS new_date;

# Similarly, we can subtract two dates and get an integer result:

SELECT DATE '2016-03-01' - DATE '2016-02-01' AS days_in_feb;

In [4]:
SELECT DATE_TRUNC('month', created_at) AS month_date,
COUNT(1) AS monthly_chats_vol
FROM conversations
WHERE EXTRACT(year FROM created_at) = 2020
GROUP BY 1
ORDER BY 1;

UsageError: Cell magic `%%sql` not found.

In [ ]:
# First, let's look at the number of monthly sales. We can use the following aggregate query using the DATE_TRUNC method:

SELECT DATE_TRUNC('month', sales_transaction_date)
AS month_date,
COUNT(1) AS number_of_sales
FROM sales
WHERE EXTRACT(year FROM sales_transaction_date) = 2018
GROUP BY 1
ORDER BY 1;

In [ ]:
#Next, we can look at how this compares with the number of new customers joining each month:

SELECT 
    DATE_TRUNC('month', date_added)
        AS month_date,
    COUNT(1) AS number_of_new_customers
FROM customers
WHERE EXTRACT(year FROM date_added) = 2018
GROUP BY 1
ORDER BY 1;